tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nicoverbruggen/cask"
tap "shivammathur/php"
tap "stripe/stripe-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Shell extension to jump to frequently used directories
brew "autojump"
# Dependency Manager for PHP
brew "composer"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# User interface to the TELNET protocol
brew "telnet"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# General-purpose scripting language
brew "shivammathur/php/php@7.3"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Collection of apps available by subscription
cask "setapp"
# Move and resize windows with ease
cask "spectacle"
# Text editor for code, markup and prose
cask "sublime-text"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Messaging app with a focus on speed and security
cask "telegram"
# Desktop client for Telegram messenger
cask "telegram-desktop"
mas "LINE", id: 539883307
